name: "f110_policy"
backend: "onnxruntime"
max_batch_size: 0

input [
  {
    name: "observation"
    data_type: TYPE_FP32
    dims: [ 1, 180 ]
  }
]

output [
  {
    name: "action"
    data_type: TYPE_INT32
    dims: [ 1, 1 ]
  },
  {
    name: "action_logits"
    data_type: TYPE_FP32
    dims: [ 1, 25 ]
  }
]
